### Manipulando dados

In [5]:
#importando os pacotes
import pandas as pd
import numpy as np

In [8]:
#acessando o help dos pacotes
pd?

In [10]:
#Criando um dicionário com os dados
dados = {
        'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
        'acessos': [100, 200, 300, 400, 500],
        'site': ['site1', 'site2', 'site3', 'site4', 'site5'],
        'vendas': [1000.52, 1052.34, 2002, 5000, 300],
        }

In [11]:
#para printar o dicionário

In [12]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site2', 'site3', 'site4', 'site5'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

In [15]:
#verificando o tipo de dicionário
type(dados)

dict

In [17]:
#Acessando as chaves do meu dicionário
dados.keys()

dict_keys(['canal_venda', 'acessos', 'site', 'vendas'])

In [18]:
#Acessando uma chave específica
dados['canal_venda']

['facebook', 'twitter', 'instagram', 'linkedin', 'facebook']

In [19]:
#Acessando uma posição específica de um dicionário
dados['canal_venda'][2]

'instagram'

In [21]:
#Acessando posições retroativas em relação a posição especificada de um dicionário
dados['canal_venda'][:2]

['facebook', 'twitter']

### Listas

In [22]:
#Criando uma lista
lista = [200, 200, 300, 800, 200]

In [24]:
#Printando a lista
lista

[200, 200, 300, 800, 200]

In [25]:
#Vendo valores específicos
lista[1]

200

In [31]:
#Fatia da lista
lista[:3]

[200, 200, 300]

In [32]:
#Adicionando a lista ao dicionário

In [33]:
dados['lista'] = lista

In [34]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site2', 'site3', 'site4', 'site5'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 300, 800, 200]}

### Dataframes

In [35]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site2', 'site3', 'site4', 'site5'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 300, 800, 200]}

In [36]:
#Criar um data frame a partir de um dict
dataframe = pd.DataFrame(dados)

In [38]:
#Acessando o dataframe
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site2  1052.34    200
2   instagram      300  site3  2002.00    300
3    linkedin      400  site4  5000.00    800
4    facebook      500  site5   300.00    200

In [43]:
#Printando os primeiros casos do dataframes
dataframe.head(2)

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site2  1052.34    200

In [40]:
#Verificando o formato do dataframe
dataframe.shape

(5, 5)

In [44]:
#Verificando o indíce do dataframe
dataframe.index

RangeIndex(start=0, stop=5, step=1)

In [49]:
#Verificando os tipos dos dados do dataframe
dataframe.dtypes

canal_venda     object
acessos          int64
site            object
vendas         float64
lista            int64
dtype: object

In [50]:
#Verificando os quantidade por tipo dos dados do dataframe
dataframe.dtypes.value_counts()

int64      2
object     2
float64    1
dtype: int64

In [51]:
#Verificando se existem valores faltantes
dataframe.isna()

   canal_venda  acessos   site  vendas  lista
0        False    False  False   False  False
1        False    False  False   False  False
2        False    False  False   False  False
3        False    False  False   False  False
4        False    False  False   False  False

In [52]:
#Verificando se existem valores faltantes
dataframe.isna().sum()

canal_venda    0
acessos        0
site           0
vendas         0
lista          0
dtype: int64

In [54]:
#Printando os nomes das colunas
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [55]:
#Acessando uma coluna específica
dataframe['canal_venda']

0     facebook
1      twitter
2    instagram
3     linkedin
4     facebook
Name: canal_venda, dtype: object

In [68]:
#Criando uma nova coluna
dataframe['nova_coluna'] = [1, 2, 3, 4, 5]

In [57]:
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'nova_coluna'], dtype='object')

In [70]:
#Removendo colunaa
dataframe.drop(columns = 'nova_coluna', inplace = True)

In [71]:
#Printando os nomes das colunas
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [72]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site2  1052.34    200
2   instagram      300  site3  2002.00    300
3    linkedin      400  site4  5000.00    800
4    facebook      500  site5   300.00    200

In [67]:
#Acessando uma coluna específica como lista
list(dataframe['canal_venda'])

['facebook', 'twitter', 'instagram', 'linkedin', 'facebook']

In [74]:
#Removendo colunas
dataframe.drop(columns = ['acessos', 'site'])

  canal_venda   vendas  lista
0    facebook  1000.52    200
1     twitter  1052.34    200
2   instagram  2002.00    300
3    linkedin  5000.00    800
4    facebook   300.00    200

In [76]:
#Mostrando as colunas
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site2  1052.34    200
2   instagram      300  site3  2002.00    300
3    linkedin      400  site4  5000.00    800
4    facebook      500  site5   300.00    200

In [94]:
#Acessando valores específicos
dataframe['acessos'][2]

300

In [86]:
#Acessando a fatia de uma coluna
dataframe['canal_venda'][:2]

0    facebook
1     twitter
Name: canal_venda, dtype: object

In [95]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site2  1052.34    200
2   instagram      300  site3  2002.00    300
3    linkedin      400  site4  5000.00    800
4    facebook      500  site5   300.00    200

In [106]:
#Fatiando os dados usando o iloc (linhas | colunas)
dataframe.iloc[:2,:]

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site2  1052.34    200

In [118]:
#Fatiar os daods usando o loc (índice)
dataframe.loc[:2]

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site2  1052.34    200
2   instagram      300  site3  2002.00    300

In [108]:
#Selecionando colunas específicas
dataframe[['canal_venda', 'acessos']]

  canal_venda  acessos
0    facebook      100
1     twitter      200
2   instagram      300
3    linkedin      400
4    facebook      500

In [119]:
#Passando os valores através de lista 
filtro = ['canal_venda', 'acessos']

In [127]:
dataframe[filtro]

  canal_venda  acessos
0    facebook      100
1     twitter      200
2   instagram      300
3    linkedin      400
4    facebook      500

In [128]:
#Usando o método info()
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   canal_venda  5 non-null      object
 1   acessos      5 non-null      int64
 2   site         5 non-null      object
 3   vendas       5 non-null      float64
 4   lista        5 non-null      int64
dtypes: float64(1), int64(2), object(2)
memory usage: 328.0+ bytes

In [130]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site2  1052.34    200
2   instagram      300  site3  2002.00    300
3    linkedin      400  site4  5000.00    800
4    facebook      500  site5   300.00    200

In [129]:
#Pivotando os dados (coluna)
dataframe.pivot(index = 'canal_venda', columns='site', values='acessos')

site         site1  site2  site3  site4  site5
canal_venda
facebook     100.0    NaN    NaN    NaN  500.0
instagram      NaN    NaN  300.0    NaN    NaN
linkedin       NaN    NaN    NaN  400.0    NaN
twitter        NaN  200.0    NaN    NaN    NaN

In [138]:
#Pivotando os dados (colunas)
aux = dataframe.pivot(index = 'canal_venda', columns='site', values='acessos')

In [139]:
aux.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, facebook to twitter
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   site1   1 non-null      float64
 1   site2   1 non-null      float64
 2   site3   1 non-null      float64
 3   site4   1 non-null      float64
 4   site5   1 non-null      float64
dtypes: float64(5)
memory usage: 192.0+ bytes

In [159]:
#Completando os valores faltantes usando fillna
#Pivotando os dados (colunas)
aux = dataframe.pivot(index = 'canal_venda', columns='site', values='acessos')
dataframe.pivot(index = 'canal_venda', columns='site', values='acessos').fillna(0)

site         site1  site2  site3  site4  site5
canal_venda
facebook     100.0    0.0    0.0    0.0  500.0
instagram      0.0    0.0  300.0    0.0    0.0
linkedin       0.0    0.0    0.0  400.0    0.0
twitter        0.0  200.0    0.0    0.0    0.0

In [160]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site2  1052.34    200
2   instagram      300  site3  2002.00    300
3    linkedin      400  site4  5000.00    800
4    facebook      500  site5   300.00    200

In [161]:
#Mudando as colunas usando o comando melt
dataframe.melt(id_vars='site', value_vars=['canal_venda'])

    site     variable      value
0  site1  canal_venda   facebook
1  site2  canal_venda    twitter
2  site3  canal_venda  instagram
3  site4  canal_venda   linkedin
4  site5  canal_venda   facebook

In [162]:
aux

site         site1  site2  site3  site4  site5
canal_venda
facebook     100.0    NaN    NaN    NaN  500.0
instagram      NaN    NaN  300.0    NaN    NaN
linkedin       NaN    NaN    NaN  400.0    NaN
twitter        NaN  200.0    NaN    NaN    NaN

In [164]:
#Resetando o índice do dataframe
print(aux.columns)
aux = aux.reset_index()
print(aux.columns)

Index(['canal_venda', 'site1', 'site2', 'site3', 'site4', 'site5'], dtype='object', name='site')
Index(['index', 'canal_venda', 'site1', 'site2', 'site3', 'site4', 'site5'], dtype='object', name='site')

In [165]:
aux.reset_index()

site  level_0  index canal_venda  site1  site2  site3  site4  site5
0           0      0    facebook  100.0    NaN    NaN    NaN  500.0
1           1      1   instagram    NaN    NaN  300.0    NaN    NaN
2           2      2    linkedin    NaN    NaN    NaN  400.0    NaN
3           3      3     twitter    NaN  200.0    NaN    NaN    NaN

In [167]:
#Exemplo do comando melt
aux.melt(id_vars='canal_venda', value_vars=['site1', 'site2', 'site3'])

   canal_venda   site  value
0     facebook  site1  100.0
1    instagram  site1    NaN
2     linkedin  site1    NaN
3      twitter  site1    NaN
4     facebook  site2    NaN
5    instagram  site2    NaN
6     linkedin  site2    NaN
7      twitter  site2  200.0
8     facebook  site3    NaN
9    instagram  site3  300.0
10    linkedin  site3    NaN
11     twitter  site3    NaN

In [169]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site2  1052.34    200
2   instagram      300  site3  2002.00    300
3    linkedin      400  site4  5000.00    800
4    facebook      500  site5   300.00    200

In [170]:
#Somando as colunas do dataframe
dataframe.sum()

canal_venda    facebooktwitterinstagramlinkedinfacebook
acessos                                            1500
site                          site1site2site3site4site5
vendas                                          9354.86
lista                                              1700
dtype: object

In [171]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site2  1052.34    200
2   instagram      300  site3  2002.00    300
3    linkedin      400  site4  5000.00    800
4    facebook      500  site5   300.00    200

In [172]:
#Somando as linhas do dataframe
dataframe.sum(axis = 1)

0    1300.52
1    1452.34
2    2602.00
3    6200.00
4    1000.00
dtype: float64

In [175]:
#Calculando a mediana das colunas numericas
print('Por linha: ', dataframe.median(axis = 1))
print('Por linha: ', dataframe.median())

Por linha:  0    200.0
1    200.0
2    300.0
3    800.0
4    300.0
dtype: float64
Por linha:  acessos     300.00
vendas     1052.34
lista       200.00
dtype: float64

In [178]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site2  1052.34    200
2   instagram      300  site3  2002.00    300
3    linkedin      400  site4  5000.00    800
4    facebook      500  site5   300.00    200

In [176]:
#Calculando a media das colunas númericas
dataframe.mean()

acessos     300.000
vendas     1870.972
lista       340.000
dtype: float64

In [177]:
#Calculando o desvio padrão das colunas númericas
dataframe.std()

acessos     158.113883
vendas     1850.931024
lista       260.768096
dtype: float64

In [183]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site2  1052.34    200
2   instagram      300  site3  2002.00    300
3    linkedin      400  site4  5000.00    800
4    facebook      500  site5   300.00    200

In [179]:
#Usando o comando describe que calcula estatisticas descritivas para colunas númericas
dataframe.describe()

          acessos       vendas       lista
count    5.000000     5.000000    5.000000
mean   300.000000  1870.972000  340.000000
std    158.113883  1850.931024  260.768096
min    100.000000   300.000000  200.000000
25%    200.000000  1000.520000  200.000000
50%    300.000000  1052.340000  200.000000
75%    400.000000  2002.000000  300.000000
max    500.000000  5000.000000  800.000000

In [182]:
#Calculando a moda
dataframe.mode()

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1   300.00  200.0
1         NaN      200  site2  1000.52    NaN
2         NaN      300  site3  1052.34    NaN
3         NaN      400  site4  2002.00    NaN
4         NaN      500  site5  5000.00    NaN

In [186]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site2  1052.34    200
2   instagram      300  site3  2002.00    300
3    linkedin      400  site4  5000.00    800
4    facebook      500  site5   300.00    200

In [184]:
#Valor máximo por coluna
dataframe.max()

canal_venda    twitter
acessos            500
site             site5
vendas            5000
lista              800
dtype: object

In [185]:
#Valor minimo por coluna
dataframe.min()

canal_venda    facebook
acessos             100
site              site1
vendas              300
lista               200
dtype: object

In [189]:
#Printando o número de únicos
dataframe.nunique()

canal_venda    4
acessos        5
site           5
vendas         5
lista          3
dtype: int64

In [191]:
#Contando valores únicos de uma coluna
dataframe['canal_venda'].value_counts()

facebook     2
linkedin     1
instagram    1
twitter      1
Name: canal_venda, dtype: int64

In [192]:
#Valores únicos de uma coluna
dataframe['canal_venda'].unique()

array(['facebook', 'twitter', 'instagram', 'linkedin'], dtype=object)

In [193]:
#Usando o groupby com valores númericos
dataframe.groupby('site')['acessos'].sum()

site
site1    100
site2    200
site3    300
site4    400
site5    500
Name: acessos, dtype: int64

In [194]:
#Usando o groupby com valores númericos
dataframe.groupby('canal_venda')['acessos'].mean()

canal_venda
facebook     300
instagram    300
linkedin     400
twitter      200
Name: acessos, dtype: int64

In [195]:
#Usando o groupby com categorias
dataframe.groupby('site')['canal_venda'].unique()

site
site1     [facebook]
site2      [twitter]
site3    [instagram]
site4     [linkedin]
site5     [facebook]
Name: canal_venda, dtype: object

In [196]:
#Usando o groupby com categorias
dataframe.groupby('site')['canal_venda'].first()

site
site1     facebook
site2      twitter
site3    instagram
site4     linkedin
site5     facebook
Name: canal_venda, dtype: object

In [197]:
#Usando o groupby com a função egg
dataframe.groupby('canal_venda').agg({
    'site': 'unique',
    'acessos': 'sum'
})

                       site  acessos
canal_venda
facebook     [site1, site5]      600
instagram           [site3]      300
linkedin            [site4]      400
twitter             [site2]      200

In [208]:
#Correlações entre variaveis
dataframe.corr(method = 'spearman') # method = 'pearson'

         acessos    vendas     lista
acessos  1.00000  0.000000  0.335410
vendas   0.00000  1.000000  0.894427
lista    0.33541  0.894427  1.000000

In [209]:
#Criando variaveis categoricas por fatia de variavel númerica
dataframe['categoria_vendas'] = pd.cut(dataframe['vendas'],
                                        bins=[0, 1500, 2000, 8000],
                                        labels = ('0 a 1500', '1500 a 2000', '2000 a 8000'))

In [210]:
#Criando variaveis categoricas usando compreensão de lista
dataframe['categoria_acessos'] = ['maior_que_300' if x > 300 else 'menor_que_300' for x in dataframe['acessos']]

In [211]:
#Juntando dois dataframes | Criando o dataframe 2
dataframe_2 = pd.DataFrame({
    'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
    'suporte': ['Carlos', 'Carlos', 'Maria', 'Maria', 'Ezequiel']
})

In [212]:
#Realizando o merge
dataframe.merge(dataframe_2, on = 'site', how = 'left')

,canal_venda,acessos,site,vendas,lista,categoria_vendas,categoria_acessos,suporte
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300,Carlos
1,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300,Carlos
2,twitter,200,site2,1052.34,200,0 a 1500,menor_que_300,Maria
3,twitter,200,site2,1052.34,200,0 a 1500,menor_que_300,Maria
4,instagram,300,site3,2002.00,300,2000 a 8000,menor_que_300,Ezequiel
5,linkedin,400,site4,5000.00,800,2000 a 8000,maior_que_300,NaN
6,facebook,500,site5,300.00,200,0 a 1500,maior_que_300,NaN

In [232]:
#Salvando o dataframe como csv
dataframe.to_csv('dataframe.csv', sep = ';', decimal = ',', index = False)

In [233]:
#Lendo dados no formato csv
dataframe_lido = pd.read_csv('dataframe.csv', sep = ';', decimal = ',')

In [234]:
dataframe_lido.head()

,canal_venda,acessos,site,vendas,lista,categoria_vendas,categoria_acessos
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300
1,twitter,200,site2,1052.34,200,0 a 1500,menor_que_300
2,instagram,300,site3,2002.00,300,2000 a 8000,menor_que_300
3,linkedin,400,site4,5000.00,800,2000 a 8000,maior_que_300
4,facebook,500,site5,300.00,200,0 a 1500,maior_que_300